var Hobby=["일기/다이어리꾸미기","여행/투어/탐방","게임","요리","수집",
"식물/정원","독서(소설, 자기계발서, 판타지 등)","영화/드라마","음악/콘서트","뮤지컬/공연",
"박물관/미술관","걷기/달리기","등산","자전거","스포츠",
"요가/필라테스","공예/만들기","그림","노래/작사/작곡","악기",
"사진","패션"];

var Hb_img=["./img/img1.png","./img/img2.png","./img/img3.png","./img/img4.png","./img/img5.png",
"./img/img6.png","./img/img7.png","./img/img8.png","./img/img9.png","./img/img10.png",
"./img/img11.png","./img/img12.png","./img/img13.png","./img/img14.png","./img/img15.png",
"./img/img16.png","./img/img17.png","./img/img18.png","./img/img19.png",
"./img/img20.png","./img/img21.png","./img/img22.png"];

var Hb_text=["당신에게 맞는 취미는 일기/다이어리꾸미기 입니다<br>당신의 하루하루를 기록해보세요!<br>자신의 감정을 있는 그대로 담아보세요 행복했던 일을 적으며 기쁨을 즐기고, 슬펐던 일이나 화났던 일을 적으면 기분이 한결 나아질 거에요<br>그리고 스티커나 마스킹테이프, 색연필과 싸인펜 등 갖가지 도구를 사용하여 당신의 다이어리를 취향에 맞게 꾸며보세요<br>하다보면 시간가는 줄 모를걸요~?<br>현재에도 즐겁지만 일기는 나중에 추억회상하며 보면 더욱 재밌는 거 아시죠?",
"당신에게 맞는 취미는 여행/투어/탐방 입니다<br>평소 가보고 싶었던 곳이 있나요? 지금 당장 떠나요!<br>먼 해외도 좋고, 바로 옆나라도 좋고, 다른 동네, 아니면 집 주변이어도 좋아요<br>배낭 여행, 기차 여행, 관광, 맛집 탐방 등 다양한 여행/투어/탐방을 즐겨보세요<br>소중한 사람들과의 여행도 너무나 즐겁지만 혼자만의 여행도 여유롭고 자유로워 색다른 묘미가 있답니다? 여유를 즐기고 싶다면 혼자 여행해보는 것을 추천해요!",
"당신에게 맞는 취미는 게임 입니다<br>게임 좋아하세요?<br>게임을 취미로 가지기에는 게임의 인식이 좋지 않을 수도 있지만 게임의 종류는 수십 가지! 어떤 게임을 어떻게 하느냐가 중요한 거겠죠~ 그리고 취미가 굳이 거창할 필요 있을까요? 하고 싶은 것, 본인이 좋아하는 것을 즐기세요<br>다양성에서 게임을 이길 수 있는 게 있을까요? 컴퓨터, 휴대폰, VR 등 사용하는 디바이스도 다양하고, 그 장르는 더욱 다양하죠 그만큼 당신의 취향을 찾기도 쉬울 거에요<br>만약 당신의 게임 실력이 부족하고 그걸 다른 사람에게 보이고 싶지 않다면 혼자서 할 수 있는 게임을 즐겨보세요! 랜덤으로 만나는 사람들과 플레이하는 것은 또 다른 재미가 있답니다~",
"당신에게 맞는 취미는 요리 입니다<br>혹시 요리할 줄 아세요?<br>모르더라도 괜찮아요! 오늘부터 배워봐요<br>요리의 폭도 생각보다 넓은데요 베이킹처럼 간식을 만들 수도 있고 우리의 삼시세끼를 채워주는 식사를 만들 수도 있죠<br>배우는 것도 인터넷 컨텐츠로 간단한 요리방법이나 팁을 얻을 수도 있고 학원을 통해 전문적으로 배우는 방법도 있어요<br>자신에게 맞는 방식을 선택하면 돼요!<br>가족, 친구, 연인 등 소중한 사람들과 함께 하면 더욱 좋겠죠?<br>직접 만든 요리를 선물한다면 즐거움도 감동도 2배!",
"당신에게 맞는 취미는 수집 입니다<br>수집, 말 그대로 무언가를 모으는 것인데요 이런 것도 하나의 취미가 될 수 있답니다~<br>피규어, 인형처럼 돈을 많이 들어가고 누가 봐도 예쁘고 귀여운 것을 모을 수도 있겠지만 굳이 그러지 않아도 돼요<br>세상에는 다양한 수집을 하는 사람들이 많답니다! 음료를 마시고 생기는 캔,병뚜껑을 모으기도 하고, 어디에 놀러 가면 꼭 그곳에서 파는 자석을 사는 사람도 있죠<br>본인이 좋아하는 것, 모아보고 싶은 것을 한 번 수집해보세요! 하나만 있을 땐 작고 의미 없어 보여도 모아보면 다를 거에요!",
"당신에게 맞는 취미는 식물/정원 입니다<br>식물을 길러본 적 있나요?<br>눈으로 보기엔 쉬워보여도 막상 해보면 건강하고 오래 키우기 쉽지 않을걸요?<br>식물도 동물만큼 종류가 아주 다양하고 생김새도 정말 편차만별이죠<br>씨앗부터 심어서 기르기도 하고 모종을 사서 기르기도 하고 방법도 다양해요<br>동물과 달리 보는 것 외에 소통할 수 없어 키우기 더욱 까다롭지만 건강하게 자라 원하던 모습이 되면 정말 뿌듯하겠죠?<br>당신이 기르는 식물은 잘 자라지 못 한다면 무작정 해볼 수도 있지만 그 식물에 대해 공부하는 것도 좋은 방법이에요~",
"당신에게 맞는 취미는 독서(소설, 자기계발서, 판타지 등) 입니다<br>독서만큼 누구나 자유롭게 즐길 수 있는 취미는 없죠!<br>돈이 없어도 도서관에서 쉽게 대여하여 볼 수 있고 e-book으로 간편하게 볼 수도 있어요<br>장르도 다양해서 즐길거리도 많고 자연스레 지식과 독해력 등을 키울 수 있어서 특히 더 좋아요~<br>약간 지루하고 재미없을 것이라고 생각할 수도 있지만 무엇보다 여유롭게 즐길 수 있고, 장르에 따라 가끔은 흥미진진하고, 슬프고, 화나기도, 감동받기도 하는 재미있는 취미랍니다<br>그럼 지금당장 도서관으로~~",
"당신에게 맞는 취미는 영화/드라마 입니다<br>요즘 핫한 드라마나 영화가 참 많죠~! 집에서 쉴 겸 드라마나 영화를 보는 건 어떨까요?<br>밖에 나가지 않고도 편하게 즐길 수 있어요.<br>아니면 가끔 밖에 나가서 영화를 보고 오는 것도 좋을 것 같네요!<br>영화는 다양한 장르가 있으니 좋아하는 장르의 영화를 보면서 즐겨보세요.<br>딱히 좋아하는 영화 장르가 없다면 다양한 영화를 보면서 찾아보는 것도 좋겠네요!",
"당신에게 맞는 취미는 음악/콘서트 입니다<br>음악 듣는 거 좋아하세요?<br>음악에도 다양한 종류가 있죠 장르별, 나라별, 취향에 맞는 음악을 찾아가며 들어보세요!<br>당신이 모르던 특별한 장르를 접하면서 취향을 알아갈 수도?<br>또, 좋아하는 아이돌이나 가수가 있나요?<br>지금 있거나 만약 생기게 된다면 그 가수의 콘서트에 가보는 것도 좋은 경험이며 취미가 될 수 있어요!<br>특별한 도구나 재능은 필요없어요!<br>당신만의 방식으로 음악의 세계에 빠져보세요~",
"걷기/달리기 는 어떤가요?<br>걷기 달리기는 당신의 건강에도 좋지만 <br>쉽고 간단하게 할 수 있는 취미라고 생각합니다.<br>취미활동을 위한 여유 공간도 필요 없고<br>언제 어디서든 쉽게 할 수 있어요<br>그리고 다양한 효과가 있어 자기관리에도 좋습니다!<br>그리고 혼자 할 수도 있지만 여러 사람과 함께 할 수도 있는 취미네요.<br>반려동물과 함께 산책을 하는 것도 좋을 것 같아요!<p>걷기의 효과<br>1. 우울증 완화 효과<br>2. 심장병 예방 효과<br>3. 다이어트 효과<br>4. 노화로 인한 기억장애 개선<br>5. 성인병 예방 효과 <br>6. 스트레스 해소 효과<br>7. 골다공증 예방 효과</p>",
"당신에게 맞는 취미는 박물관/미술관 입니다<br>박물관, 미술관만큼 볼거리가 많은 곳도 없죠~<br>자칫 지루하게 느껴질 수도 있을 것 같아요 하지만 역사적인 것만이 박물관,미술관이라고 하진 않죠! 물론 역사적인 내용을 담은 박물관과 미술관도 의미가 있고 즐거울 수 있지만 세상에는 정말 다양한 박물관, 미술관들이 존재한답니다<br>당신이 평소에 관심있던 것에 대한 박물관에 가보세요! 만화 캐릭터여도 좋아요 그에 대한 더 많은 정보, 의미, 역사 등을 정말 즐겁고 쉽게 알 수 있을 거에요<br>또는 좋아하는 화가나 작가의 미술관, 전시회에 가보는 것도 좋아요<br>작품에 대한 설명을 들을 수도 있고 직접 눈으로 보며 작품의 질감과 표현을 느낄 수 있을 거에요 전시할 때의 연출도 직접 볼 수 있죠!<br>주변의 박물관, 미술관을 찾아보세요~",
"등산 은 어떤가요?<br>맑은 공기를 마시며 등산을 하면 건강에도 좋지만<br> 기분전환도 되고 <br>정상에 올랐을 때 뿌듯함과 만족감을 느낄 수 있습니다.<br>낮은 산에 오르는 건 많은 장비가 필요 없지만<br>높은 산을 오를 때는 위험하기 때문에 많은 장비들이 필요해요. <br>낮은 산부터 도전하는 게 좋을 것 같아요! <br>그리고 등산을 하며 아침의 선선하고 맑은 공기를 느끼며<br>하루를 시작하면 그날 하루는 기분 좋게 보낼 수 있을 것 같네요!<p>등산의 좋은점<br>1.심혈관계, 폐기능 강화에 좋습니다<br>2.근골격계 질환에 좋습니다.<br>3.면역력 강화와 정신 건강에 좋습니다.<br>4.다이어트에 좋습니다.<br>5.피부건강에 좋습니다.<br>6.허리 근육을 튼튼이 해 줍니다.</p>",
"당신에게 맞는 취미는 뮤지컬/공연 입니다.<br>뮤지컬과 공연을 보는 것을 좋아하나요? <br>별로 관심이 없었다면 이참에 한 번 보러가는건 어떨까요?<br>드라마나 영화와는 다른 재미를 느낄 수 있어요!<br>공연은 눈 앞에서 배우들의 연기를 볼 수 있어요.<br>그리고 뮤지컬은 배우들의 연기뿐만 아니라 노래도 같이 들을 수 있죠.<br>꼭 한 번 가보세요!<br>당신에게 잘 맞는 취미를 찾을 수 있을 것 같아요.<br>그게 아니더라도 분명 좋은 경험이 될 겁니다.",
"당신에게 맞는 취미는 박물관/미술관 입니다<br>박물관, 미술관만큼 볼거리가 많은 곳도 없죠~<br>자칫 지루하게 느껴질 수도 있을 것 같아요<br>하지만 역사적인 것만이 박물관,미술관이라고 하진 않죠! <br>물론 역사적인 내용을 담은 박물관과 미술관도 의미가 있고 즐거울 수 있지만<br>세상에는 정말 다양한 박물관, 미술관들이 존재한답니다<br>당신이 평소에 관심있던 것에 대한 박물관에 가보세요! <br>만화 캐릭터여도 좋아요<br>그에 대한 더 많은 정보, 의미, 역사 등을 정말 즐겁고 쉽게 알 수 있을 거에요<br>또는 좋아하는 화가나 작가의 미술관, 전시회에 가보는 것도 좋아요<br>작품에 대한 설명을 들을 수도 있고<br>직접 눈으로 보며 작품의 질감과 표현을 느낄 수 있을 거에요<br>전시할 때의 연출도 직접 볼 수 있죠!<br>주변의 박물관, 미술관을 찾아보세요~",
"스포츠는 어떤가요?<br>세상에는 정말 다양한 스포츠가 있죠! <br>스포츠 경기를 보며 즐기는 것도 좋고<br>주변에 여유 공간이 있다면 직접 해보는 것도 좋을 것 같아요<br>스포츠는 즐겁게 할 수 있는 운동이라고 생각합니다.<br>또한 직접 움직이면서 하는 스포츠도 있지만<br>e스포츠처럼 많이 움직이지 않고 하는 스포츠도 있어요.<br>관심이 가는 스포츠를 찾아 즐겨보세요!<p>스포츠 종류<br>e스포츠, 야구, 티볼, 축구, 농구, 배구, 탁구<br>, 배드민턴, 당구, 골프, 족구, 테니스,수영<br>, 태권도, 유도, 복싱, 복싱, 펜싱, 양궁</p>",
"요가/필라테스는 어떤가요?<br>재활과 자세 교정을 목적으로 하는 운동입니다<br>직접 강사님께 배울 수도 있지만 인터넷을 통해 집에서도 혼자서 할 수 있어요<br>요가와 필라테스는 차이점이 있습니다.<br>완전히 다른 장비를 사용하는데 <br>필라테스는 리포머, 캐딜락, 운다 체어, 척추 교정기 등의 기계를 사용하고<br>요가는 주로 매트와 블록, 스트랩 등을 사용합니다<br>자기관리도 되는 좋은 취미인 것 같네요~!<p>필라테스의 효과<br>1. 점진적인 체중 감소<br> 2. 부상 없는 근육 단련<br>3. 몸매를 잡아준다<br>4. 바른 자세<br>5. 유연성 증가<br>6. 스트레스 감소</p>",
"공예/만들기 는 어떤가요? 당신은 손재주가 뛰어난 것 같습니다. 아니면 손재주가 뛰어나지 않아도 공예/만들기를 했을때 당신에게 잘 어울리는 취미활동이 될 것 같습니다.<p>공예 종류<br>식물공예, 주얼리공예, 양말공예, 종이접기공예, 인형공예, 뜨개질공예, 석고방향제, 캐리커쳐, 골판지공예, 드림캐쳐, 비누공예, 풍선아트, 재활용공예, 플리저브드플라워공예",
"그림 은 어떤가요? 당신은 상상력이 풍부하거나 손재주가 좋은 사람인 것 같습니다. 또한 예술적 감각이 있고 감수성이 풍부할 수도 있을거라는 생각이 듭니다. 당신의 그린 그림은 정말 멋진 작품이 될 것 같습니다.<p>종류<br>데생, 크로키, 스케치, 수채화, 유화, 아크릴화, 파스텔화<br>템페라화 - 물감을 고착시키는 매질로 기름이 아닌 다른 재료를 사용하는 모든 화법을 통틀어 일컫는 용어<br>프레스코, 판화, 콜라주, 모자이크, 풍경화, 인물화, 초상화, 정물화, 추상화, 만화, 캐리커쳐, 포스터, CG, 어진",
"노래/작사/작곡 은 어떤가요? 당신은 음악에 재능이 있거나 음악이 잘 어울리는 사람인 것 같습니다.<br>노래를 잘 부르거나 잘 부르지 못 해도 노래 부르는걸 좋아하는 것 같습니다. 만약 노래부르는걸 좋아하지 않는다면 노래를 감상하는걸 좋아하는 것 같습니다. 그렇다면 노래를 직접 작사 작곡 해보는건 어떨까요? 당신에게 멋기고 잘 어울리는 취미가 생길거라고 생각합니다<p>참고<br>노래방 다니기<br>작사, 작곡하기",
"악기 는 어떤가요? 당신은 악기를 연주하는 것에 재능이 있을 수도 있습니다.<br>만약 악기를 다룰 줄 모른다면 이참에 배워보는것은 어떤가요. 당신에게 좋은 취미 활동이 될 수 있을거라고 생각합니다<p>추천<br>피아노, 드럼, 기타, 베이스",
"사진 은 어떤가요? 당신은 주변에 관심이 많은 것 같습니다. 주변 풍경이나 인물을 찍어보는 건 어떤가요. 여행을 다니며 풍경을 찍는것도 좋을 것 같습니다. 언제 어디서든 쉽게 즐길 수 있는 취미라고 생각합니다. 자유로운 성격을 가진 당신에게 어울릴 것 같습니다.<p>참고<br>카메라, 스마트폰으로 찍기<br>풍경이나 인물 등",
"패션 은 어떤가요? 당신은 꾸밀 줄 아는 사람인 것 같습니다. 약속이 있으면 옷을 고르는데 가장 시간이 오래 걸릴 것 같습니다 자신만의 패션 스타일이 없다면 찾아보는건 어떤가요? 당신에게 좋은 취미가 될 것 같습니다.<p>패션 스타일 종류<br>캐주얼 스타일, 스트릿 스타일, 빈티지 스타일, 놈코어 스타일, 모던 스타일, 페미닌 스타일, 댄디 스타일, 미니멀리즘 스타일, 맥시멀리즘 스타일, 아메리칸 캐주얼 스타일, 레이어드 스타일, 클래식 스타일, 스포티 스타일, 에스닉 스타일, 아방가르드 스타일"
];

let d = document.getElementsByClassName("text_box")[0];
let text = document.createElement('div');

//페이지 시작 시 자동실행되는 함수
window.onload=function(){
    const urlParams = new URL(location.href).searchParams;
    
    const result_h = urlParams.get('op');
    
    document.getElementById("result_hobby").innerHTML = Hobby[result_h];
    document.getElementById("hb_img").src=Hb_img[result_h];

    

    //설명
    text.setAttribute('class','hobby_text');
    //text.innerHTML=Hb_text[0];
    text.innerHTML=Hb_text[result_h];
    d.appendChild(text);
  }

//로그인 박스
let di=document.getElementsByClassName("dialog")[0];
function dia(){
    di.style.width="500px"
    di.style.height="300px";
    di.style.visibility="visible";
}
function close_d(){
    di.style.visibility="hidden";
    di.style.width="0px"
    di.style.height="0px";
}

//user
let u=document.getElementsByClassName("userdrop")[0];
let u_cnt=0;
function uesr(){
  if(++u_cnt % 2 ==1){
    u.style.width="120px";
    u.style.paddingRight="40px";
    u.style.height="100px";
    u.style.visibility="visible";
  }
  else{
    u.style.visibility="hidden";
    u.style.width="0px";
    u.style.height="0px";
  }
}